#+TITLE: Intro to Java Programming
#+AUTHOR: Scott Runnels
#+LANGUAGE: en
#+EXPORT_FILE_NAME: part03c.pdf
#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:nil -:nil f:t *:t <:t 
#+BIND: org-latex-caption-above nil
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+LaTeX_CLASS_OPTIONS: [aspectratio=169]
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+COLUMNS: %20ITEM %13BEAMER_env(Env) %6BEAMER_envargs(Args) %4BEAMER_col(Col) %7BEAMER_extra(Extra)
#+BEAMER_THEME: metropolis
# #+BEAMER_OUTER_THEME: miniframes [subsection=false]
#+BEAMER_HEADER: \subtitle{Arrays}
# #+BEAMER_HEADER: \AtBeginSection[]{ # This line inserts a table of contents
# #with the current section highlighted at # the beginning of each section
# #+BEAMER_HEADER: \begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame} #
# #In order to have the miniframes/smoothbars navigation bullets even though we
# #do not use subsections # q.v.
# #https://tex.stackexchange.com/questions/2072/beamer-navigation-circles-without-subsections/2078#2078
# #+BEAMER_HEADER: \subsection{} +BEAMER_HEADER: }
#+LATEX_HEADER: \definecolor{myblue}{RGB}{20,105,176}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage[listings, many]{tcolorbox}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{etoolbox}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usetikzlibrary{positioning}
#+LATEX_HEADER: \usepackage{local-style}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{tcolorbox}[enhanced,colframe=myblue,boxrule=1pt,boxsep=1pt,left=1pt,right=1pt,top=-0pt,bottom=0pt,arc=0pt,toprule=0pt, rightrule=0pt,colback=white,attach boxed title to top left={yshift=-0pt},title=Code,boxed title style={colback=myblue, right=0mm, bottomrule=0pt, left=0mm, arc=0pt}, fonttitle=\tiny]}%
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{tcolorbox}}%
#+LATEX_HEADER: \usepackage{parskip}
** Getting the size of an Array
   #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
   #+begin_src java  :exports both :wrap resultscode
     int[] numbers = new int[4];
     numbers[0] = 42;
     numbers[1] = 13;
     numbers[2] = 12;
     numbers[3] = 7;

     System.out.println("The array has " + numbers.length + " elements.");

     int index = 0;
     while (index < numbers.length) {
         System.out.println(numbers[index]);
         index = index + 1;
     }
   #+end_src

   #+RESULTS:
   #+begin_resultscode
   The array has 4 elements.
   42
   13
   12
   7
   #+end_resultscode


** Array as a parameter of a method
   #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
   #+begin_src java :wrap resultscode :exports code
     public static void listElements(int[] integerArray) {
         System.out.println("the elements of the array are: ");
         int index = 0;
         while (index < integerArray.length) {
             int number = integerArray[index];
             System.out.print(number + " ");
             index = index + 1;
         }

         Synstem.out.println("");
     }
   #+end_src

   #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,firstline=,lastline=   
   #+begin_src java :wrap resultscode :exports code
     public static void listElements(int[] integerArray) {
         System.out.println("the elements of the array are: ");
         int index = 0;
         while (index < integerArray.length) {
             int number = integerArray[index];
             System.out.print(number + " ");
             index = index + 1;
         }
         System.out.println("");
     }

     public static void main(String[] args){
         int[] numbers = new int[3];
         numbers[0] = 1;
         numbers[1] = 2;
         numbers[2] = 3;

         listElements(numbers);         
     }
   #+end_src

   #+RESULTS:
   #+begin_resultscode
   the elements of the array are: 
   1 2 3 
   #+end_resultscode



